set defaults to true and removed commas

<img width="1099" alt="Screen Shot 2022-11-22 at 23 13 05" src="https://user-images.githubusercontent.com/24765473/203468027-4e1432a5-49a4-44df-b04a-4b97041eae64.png">

```
  local_policy_boolean = {
    "constraints/commerceorggovernance.disablePublicMarketplace" = true


Step #2 - "tf plan": Terraform will perform the following actions:
Step #2 - "tf plan": 
Step #2 - "tf plan":   # module.core-org-policy.google_organization_policy.boolean["constraints/commerceorggovernance.disablePublicMarketplace"] will be created
Step #2 - "tf plan":   + resource "google_organization_policy" "boolean" {
Step #2 - "tf plan":       + constraint  = "constraints/commerceorggovernance.disablePublicMarketplace"
Step #2 - "tf plan":       + etag        = (known after apply)
Step #2 - "tf plan":       + id          = (known after apply)
Step #2 - "tf plan":       + org_id      = "959133349631"
Step #2 - "tf plan":       + update_time = (known after apply)
Step #2 - "tf plan":       + version     = (known after apply)
Step #2 - "tf plan": 
Step #2 - "tf plan":       + boolean_policy {
Step #2 - "tf plan":           + enforced = true
Step #2 - "tf plan":         }
Step #2 - "tf plan":     }
```